Revit 2027 API
Transform.CreateTranslation Method
 Creates a transform that represents a translation via the specified vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform CreateTranslation(
	XYZ vector
)
Public Shared Function CreateTranslation (
	vector As XYZ
) As Transform
public:
static Transform^ CreateTranslation(
	XYZ^ vector
)
static member CreateTranslation :
        vector : XYZ -> Transform
Parameters
vector XYZ
 The translation vector.
Return Value
Transform
 The new transform.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace